app/controllers/categories_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."category_id" IN (1, 2, 3, 4) LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
---
  def show
    @posts = Post.where(category_id: [@category.subtree_ids]).paginate(page: params[:page], per_page: 5)

SELECT "categories".* FROM "categories" WHERE (id != ) ORDER BY "categories"."name" ASC
---
  def new
    @category = Category.new
    @categories = Category.all.order(:name)

INSERT INTO "categories" ("name", "created_at", "updated_at", "ancestry") VALUES (?, ?, ?, ?)  [["name", "JS"], ["created_at", "2018-05-09 12:47:39.508516"], ["updated_at", "2018-05-09 12:47:39.508516"], ["ancestry", "1"]]
---
  def create
    @category = Category.new(category_params)
    if @category.save

SELECT "categories".* FROM "categories" WHERE (id != 2) ORDER BY "categories"."name" ASC
---
  def edit
    @categories = Category.where("id != #{@category.id}").order(:name)

UPDATE "categories" SET "ancestry" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["ancestry", "1"], ["updated_at", "2018-05-03 15:30:09.893119"], ["id", 2]]
SELECT "categories".* FROM "categories" WHERE (id != 1) ORDER BY "categories"."name" ASC
---
  def update
    if @category.update_attributes(category_params)
      redirect_to categories_path, success: 'Категорія успішно оновлена'
    else
      @categories = Category.where("id != #{@category.id}").order(:name)