app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"
---
	def index
		@posts = Post.paginate(page: params[:page], per_page: 5)

INSERT INTO "posts" ("title", "summary", "body", "created_at", "updated_at", "category_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "a"], ["summary", "a"], ["body", "<div>a</div>"], ["created_at", "2018-05-05 18:32:50.671759"], ["updated_at", "2018-05-05 18:32:50.671759"], ["category_id", 4]]
---
	def create
		@post = Post.new(post_params)
		if @post.save

UPDATE "posts" SET "body" = ?, "image" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "<div>vxdv h f df gdf gdfg d</div>"], ["image", "Знімок_з_2018-04-13_10-41-34.png"], ["updated_at", "2018-04-13 08:35:48.342818"], ["id", 13]]
---
	def update
		if @post.update_attributes(post_params)