app/views/categories/_form.html.erb

SELECT "categories".* FROM "categories" WHERE (id != 2) ORDER BY "categories"."name" ASC
---
		<%= f.label :parent_id %>
		<%= f.collection_select :parent_id, Category.where("id != #{@category.id}").order(:name), :id, :name, { include_blank: true }, class: 'form-control' %>